string = 'My name is Olga'  # дана строка
print(string[2])  # вывести 3й символ
print(string[-2])  # вывести пердпоследний символ
print(string[0:5])  # вывести первые пять символов
print(string[0:-2])  # вывести всю строку кроме последних 2
print(string[::2])  # вывести символы с четными индексами
print(string[1::2])  # вывести с нечетными индексами начиная со второго
print(string[::-1])  # вывести в обратном порядке
print(string[::-2])  # вывести через 1 в обратном порядке, начиная с последнего
print(len(string))  # вывести длину строки

