# Дана длина ребра куба х, найти объем куба и площадь его боковой поверхности
x = int(input('введиде число '))
print(x**2)
print(x**3)